Catalogs/Удалить_фин_ШаблоныОтраженияФактическихДанныхПоБюджетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Удалить_фин_ШаблоныОтраженияФактическихДанныхПоБюджетам</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.фин_ВидыДокументов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляКомплектаБюджетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоНовогоФормата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СхемыОтраженияФактическихДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборПравилОтражения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БазовыйИдентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ВидыОтраженийПервичныхДокументовВБюджетировании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяИсточника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеИсточника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособИспользования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_СпособИспользованияШаблонаОтраженияВБюджетировании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВалютаОперацииИсточник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВалютаОперацииТипИсточника</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ТипыИсточниковОтраженияПервичныхДвижений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьКоличествоИсточник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_НастройкиПолученияСоответствийДляПервичныхДанныхБюджетирования</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьКоличествоТипИсточника</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ТипыИсточниковОтраженияПервичныхДвижений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьКонтрагентИсточник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
								<v8:Type>cfg:CatalogRef.фин_НастройкиПолученияСоответствийДляПервичныхДанныхБюджетирования</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьКонтрагентТипИсточника</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ТипыИсточниковОтраженияПервичныхДвижений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьНоменклатураИсточник</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьНоменклатураТипИсточника</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ТипыИсточниковОтраженияПервичныхДвижений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПроектИсточник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПроектТипИсточника</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ТипыИсточниковОтраженияПервичныхДвижений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСуммаИсточник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_НастройкиПолученияСоответствийДляПервичныхДанныхБюджетирования</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСуммаТипИсточника</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ТипыИсточниковОтраженияПервичныхДвижений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьФинансовыйПоказательИсточник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
								<v8:Type>cfg:CatalogRef.фин_НастройкиПолученияСоответствийДляПервичныхДанныхБюджетирования</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьФинансовыйПоказательТипИсточника</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ТипыИсточниковОтраженияПервичныхДвижений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЦФОИсточник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЦФОТипИсточника</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ТипыИсточниковОтраженияПервичныхДвижений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.усд_УсловияВыполненияОперацийПоСтрокамДокумента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонПроводок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ШаблоныПроводокПоСчетамБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Правило</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ПравилаОтраженияФактическихДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПравил</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ВидыОтраженийПервичныхДокументовВБюджетировании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяИсточника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеИсточника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособИспользования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_СпособИспользованияШаблонаОтраженияВБюджетировании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеВыполненияГруппыШаблонов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.усд_УсловияВыполненияОперацийПоСтрокамДокумента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/фин_ВидыОтраженийПервичныхДокументовВБюджетировании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ВидыОтраженийПервичныхДокументовВБюджетировании</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоШапкеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоТабличнойЧасти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДвижениямВРегистрах</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/фин_СпособИспользованияШаблонаОтраженияВБюджетировании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_СпособИспользованияШаблонаОтраженияВБюджетировании</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Всегда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсегдаЕслиУдовлетворяетУсловию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕслиУдовлетворяетУсловию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕслиНеНайденУдовлетворяющийУсловиюШаблон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Удалить_фин_ШаблоныОтраженияФактическихДанныхПоБюджетам/Ext/ObjectModule.bsl
//Процедура ПередЗаписью
//
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка ИЛИ ДополнительныеСвойства.Свойство("ВнешняяОбработка") Тогда
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаГруппы Из ГруппыПравил Цикл
		Строки = ГруппыПравил.НайтиСтроки(Новый Структура("Представление",СтрокаГруппы.Представление));
		Если Строки.Количество() >1 Тогда
			Сообщить("Элемент справочника Шаблоны отражения фактических данных по бюджетам 
			|	"+Ссылка+" не может быть записан, так как группа с наименованием "+СтрокаГруппы.Представление+" значится в списке более одного раза!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаТЧ Из НаборПравилОтражения Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ВидДанных) Тогда
			Сообщить("Элемент справочника Шаблоны отражения фактических данных по бюджетам 
			|	"+Ссылка+" не может быть записан, так как в строке №"+Строка(СтрокаТЧ.НомерСтроки)+" не указан вид данных");
			Отказ = Истина;
		ИначеЕсли СтрокаТЧ.ВидДанных <>Перечисления.фин_ВидыОтраженийПервичныхДокументовВБюджетировании.ПоШапкеДокумента И СтрокаТЧ.ИмяИсточника="" Тогда
			Сообщить("Элемент справочника Шаблоны отражения фактических данных по бюджетам 
			|	"+Ссылка+" не может быть записан, так как в строке №"+Строка(СтрокаТЧ.НомерСтроки)+" не указан источник данных");
			Отказ = Истина;
		КонецЕсли;
		Если СтрокаТЧ.СпособИспользования = Перечисления.фин_СпособИспользованияШаблонаОтраженияВБюджетировании.ВсегдаЕслиУдовлетворяетУсловию 
			ИЛИ СтрокаТЧ.СпособИспользования = Перечисления.фин_СпособИспользованияШаблонаОтраженияВБюджетировании.ЕслиУдовлетворяетУсловию Тогда
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Условие) Тогда
				Сообщить("Элемент справочника Шаблоны отражения фактических данных по бюджетам 
				|	"+Ссылка+" не может быть записан, так как в строке №"+Строка(СтрокаТЧ.НомерСтроки)+" не указано условие использования");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли
	КонецЦикла;
КонецПроцедуры //ПередЗаписью

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка ИЛИ ДополнительныеСвойства.Свойство("ВнешняяОбработка") Тогда
		Возврат;
	КонецЕсли;
	//Если ДополнительныеСвойства.Свойство("КонтрольВыполнен") Тогда
	//	ДополнительныеСвойства.Удалить("КонтрольВыполнен");
	КонтрольЗаписейПараметров();
КонецПроцедуры

Процедура КонтрольЗаписейПараметров()  Экспорт
	МассивИдентификаторов = Новый Массив;
	Для Каждого СтрокаТЧ Из НаборПравилОтражения Цикл
		МассивИдентификаторов.Добавить(СтрокаТЧ.БазовыйИдентификатор);
	КонецЦикла;
	РегистрСведенийНаборЗаписей = РегистрыСведений.Удалить_фин_ПараметрыШаблоновОтраженияФактическихДанных.СоздатьНаборЗаписей();
	РегистрСведенийНаборЗаписей.Отбор.Шаблон.Значение 		= Ссылка;
	РегистрСведенийНаборЗаписей.Отбор.Шаблон.Использование 	= Истина;
	РегистрСведенийНаборЗаписей.Прочитать();
	МассивУдалить = Новый Массив;
	Модификация = Ложь;
	Для Каждого СтрокаНабора Из РегистрСведенийНаборЗаписей Цикл
		Если МассивИдентификаторов.Найти(СтрокаНабора.ИдентификаторСтроки)=Неопределено Тогда
			МассивУдалить.Добавить(СтрокаНабора);
			Модификация = Истина;
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаУдалить Из МассивУдалить Цикл
		РегистрСведенийНаборЗаписей.Удалить(СтрокаУдалить);
	КонецЦикла;
	РегистрСведенийНаборЗаписей.Записать();
КонецПроцедуры
